package com.boye.common.exception;

/**
 * 错误代码定义
 * 
 */
public enum ExecptionCode implements IExceptionCode {

	SUCCESS("0", "SUCCESS"),
	DEFAULT_SUCCESS("0000", "成功"),
	DEFAULT_ERROR("9999", "失败"),
	
	//正则验证相关异常
	/** 全是数字 */
	REGULAR_0001("0001","全是数字"),
	
	/** 全是字母 */
	REGULAR_0002("0002","全是字母"),
	
	/** [6-16]位之间 */
	REGULAR_0003("0003","[6-16]位之间"),
	
	
	
	//注册相关异常 (编码以00** 开头， 名称以REGIST开头 )
	/** 图片验证码会话过期异常 */
	REGIST_CAPTCHA_TIMEOUT("0050", "图片验证码已超时, 请返回重新输入图片验证码"),
	/** 手机号码错误 */
	REGIST_0001("0001", "手机号码错误"),
	/** 该号码已注册 */
	REGIST_0002("0002", "该号码已注册"),
	/** 操作太过频繁 */
	REGIST_0003("0003", "操作频繁,稍后再试"),
	/** 验证码错误 */
	REGIST_0004("0004", "验证码错误"),
	/** 短信验证码错误 */
	REGIST_0051("0051", "短信验证码错误，请核对并修正！"),
	/** 图片验证码错误 */
	REGIST_0052("0052", "图片验证码输入错误，请重新输入"),
	
	/** 密码长度6-16位 */
	REGIST_PASSWORD_INVALID("0005", "密码长度6-16位"),
	/** 系统错误 */
	REGIST_0006("0006", "系统错误"),
	/** 验证码已过期 */
	REGIST_0007("0007", "验证码已过期"),
	/** 两次密码不一致 */
	REGIST_0008("0008", "两次密码不一致"),
	/** 权限不足 */
	REGIST_0009("0009", "权限不足"),

	/** 新用户注册 */
	REGIST_0010("0010", "新用户注册"),
	
	/** 登录密码和支付密码不能相同    */
    REGIST_0011("0011", "登录密码和支付密码不能相同"),
	
	
	//用户登录, 规则以 LOGIN开头
	/** 用户不存在 */
	LOGIN_0011("0011", "用户不存在"),
	/** 密码错误 */
	LOGIN_0012("0012", "密码错误"),
	/** 密码错误已超过7次，请半小时之后在进行操作 */
	EXECPTION_0013("0013", "密码错误已超过7次，请半小时之后在进行操作"),
	/** 验证码不能为空 */
	EXECPTION_0014("0014", "验证码不能为空"),
	/** 异常渠道操作 */
	EXECPTION_0015("0015", "异常渠道操作"),
	/** 原密码错误 */
	EXECPTION_0016("0016", "原密码错误"),
	/** 密码输入错误次数过多，2小时之内不能在执行该操作 */
	EXECPTION_0017("0017", "密码输入错误次数过多，2小时之内不能在执行该操作"),
	/** 未登录 */
	EXECPTION_0018("0018", "未登录"),
	/** 已登陆 */
	EXECPTION_0019("0019", "已登陆"),

	/** 含有空字段 */
	EXECPTION_0020("0020", "含有空字段"),
	/** 对象不存在 */
	EXECPTION_0021("0021", "对象不存在"),
	/** 资产机构还未添加 */
	EXECPTION_0022("0022", "资产机构还未添加"),
	/** 资产类型错误 */
	EXECPTION_0023("0023", "资产类型错误"),
	/** 非初始导入类型 */
	EXECPTION_0024("0024", "非初始导入类型"),
	/** 可售资产为零 */
	EXECPTION_0025("0025", "可售资产为零"),
	/** 类型不匹配不能添加 */
	EXECPTION_0026("0026", "类型不匹配不能添加"),
	/** 参数错误 */
	EXECPTION_0027("0027", "参数错误"),
	/** 时间超出限期 */
	EXECPTION_0028("0028", "时间超出限期"),
	/** 参数不能为空 */
	EXECPTION_0029("0029", "参数不能为空"),

	/** 身份证错误 */
	EXECPTION_0030("0030", "身份证错误"),
	/** 资产机构代号已存在 */
	EXECPTION_0031("0031", "资产机构代号已存在"),
	/** 小于最小购买金额 */
	EXECPTION_0032("0032", "小于最小购买金额"),
	/** 购买金额超出可售金额 */
	EXECPTION_0033("0033", "购买金额超出可售金额"),
	/** 基金系统维护中 */
	EXECPTION_0034("0034", "基金系统维护中"),

	/** 图片不存在 */
	EXECPTION_0041("0041", "图片不存在"),
	/** 图片不存在 */
	EXECPTION_0042("0042", "图片上传失败"),
	/** 图片超过限定大小 */
	EXECPTION_0043("0043", "图片超过限定大小"),
	/** 项目名已存在 */
	EXECPTION_0044("0044", "项目名已存在"),
	/** 状态错误 */
	EXECPTION_0045("0045", "状态错误"),
	/** 短信类型错误 */
	EXECPTION_0046("0046", "短信类型错误"),

	/** 交易记录已经存在错误 */
	EXCEPTION_PAYMENT_EXISTS("0100", "支付帐单已存在， 此订单已经在支付中或支付已完成， 请查看你的交易记录。"),

	/** 交易类 */
	EXCEPTION_PAYMENT_0101("0101", "密码格式错误:只能是6位纯数字"),
	
	/** 账户安全险，支付时没有保单 */
	EXCEPTION_PAYMENT_0102("0102", "暂无可售保险产品，请联系满兜客服"),
	
	EXCEPTION_PAYMENT_0103("0103", "支付密码错误"),
	
	USER_CHECK_0200("0200", "未实名认证"),
	
	USER_CHECK_0201("0201", "姓名或身份证号码不匹配"),
	
	USER_CHECK_0202("0202", "您的账号已被冻结！如有疑问，请联系客服"),
	
	EXCEPTION_BANK_0300("0300", "银行提现正在维护中"),
	
	EXCEPTION_BANK_0301("0301", "银行支付正在维护中"),
	
	/** 系统维护中， 一般是服务器上配置，应用里边无需调用， 这里只是占个位置 */
	SYSTEM_REPAIR("5030", "系统维护中"),


    /** 告警任务*/
    WARN_TASK_10("10","数据更新成功，告警任务异常"),
    
    /** 数据更新异常*/
    WARN_TASK_0("0","数据更新异常"),
    
    /** 服务不可用*/
    RESOURCE_DISABLED("0","服务不可用"),
	;
	private String code;

	private String describe;

	ExecptionCode(String code, String describe) {
		this.code = code;
		this.describe = describe;
	}

	public String getCode() {
		return code;
	}

	public String getDescribe() {
		return describe;
	}

}
